FIO_tests/multi_testing/fio_results_20250310_170908/fio_results.txt
metadata-access-disk1: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
metadata-access-disk2: (g=1): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
database-workload-disk1: (g=2): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=32
...
database-workload-disk2: (g=3): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=32
...
file-server-disk1: (g=4): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
file-server-disk2: (g=5): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
streaming-reads-disk1: (g=6): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
streaming-reads-disk2: (g=7): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
streaming-writes-disk1: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
streaming-writes-disk2: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
mixed-workload-disk1: (g=10): rw=randrw, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=32
...
mixed-workload-disk2: (g=11): rw=randrw, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=32
...
latency-test-disk1: (g=12): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
latency-test-disk2: (g=13): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.33
Starting 34 threads

metadata-access-disk1: (groupid=0, jobs=4): err= 0: pid=300806: Mon Mar 10 17:57:12 2025
  Description  : [Simulates metadata operations on disk1 (small random I/O)]
  read: IOPS=114k, BW=446MiB/s (468MB/s)(78.4GiB/180001msec)
    slat (nsec): min=1636, max=687516, avg=4374.97, stdev=6117.93
    clat (usec): min=42, max=2869, avg=448.02, stdev=157.85
     lat (usec): min=67, max=2893, avg=452.39, stdev=158.31
    clat percentiles (usec):
     |  1.00th=[  145],  5.00th=[  192], 10.00th=[  233], 20.00th=[  302],
     | 30.00th=[  359], 40.00th=[  404], 50.00th=[  449], 60.00th=[  498],
     | 70.00th=[  537], 80.00th=[  578], 90.00th=[  644], 95.00th=[  701],
     | 99.00th=[  832], 99.50th=[  881], 99.90th=[ 1004], 99.95th=[ 1057],
     | 99.99th=[ 1188]
   bw (  KiB/s): min=361074, max=588808, per=100.00%, avg=457225.98, stdev=12897.88, samples=1436
   iops        : min=90268, max=147201, avg=114305.77, stdev=3224.46, samples=1436
  write: IOPS=28.5k, BW=111MiB/s (117MB/s)(19.6GiB/180001msec); 0 zone resets
    slat (nsec): min=1809, max=659808, avg=5235.19, stdev=6356.21
    clat (usec): min=37, max=15258, avg=421.91, stdev=201.71
     lat (usec): min=40, max=15270, avg=427.14, stdev=202.31
    clat percentiles (usec):
     |  1.00th=[   82],  5.00th=[  112], 10.00th=[  143], 20.00th=[  204],
     | 30.00th=[  285], 40.00th=[  371], 50.00th=[  437], 60.00th=[  510],
     | 70.00th=[  562], 80.00th=[  603], 90.00th=[  660], 95.00th=[  717],
     | 99.00th=[  840], 99.50th=[  889], 99.90th=[  988], 99.95th=[ 1037],
     | 99.99th=[ 1172]
   bw (  KiB/s): min=89577, max=149248, per=100.00%, avg=114278.55, stdev=3235.79, samples=1436
   iops        : min=22394, max=37312, avg=28568.92, stdev=808.95, samples=1436
  lat (usec)   : 50=0.01%, 100=0.69%, 250=14.56%, 500=45.06%, 750=36.77%
  lat (usec)   : 1000=2.81%
  lat (msec)   : 2=0.10%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=8.22%, sys=20.12%, ctx=2683960, majf=0, minf=4
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=20555339,5137855,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
metadata-access-disk2: (groupid=1, jobs=4): err= 0: pid=303571: Mon Mar 10 17:57:12 2025
  Description  : [Simulates metadata operations on disk2 (small random I/O)]
  read: IOPS=89.6k, BW=350MiB/s (367MB/s)(61.5GiB/180004msec)
    slat (nsec): min=1645, max=1046.8k, avg=5077.45, stdev=6715.80
    clat (usec): min=14, max=6823, avg=626.82, stdev=602.16
     lat (usec): min=45, max=6826, avg=631.90, stdev=602.40
    clat percentiles (usec):
     |  1.00th=[  137],  5.00th=[  169], 10.00th=[  198], 20.00th=[  258],
     | 30.00th=[  318], 40.00th=[  371], 50.00th=[  416], 60.00th=[  465],
     | 70.00th=[  545], 80.00th=[  775], 90.00th=[ 1516], 95.00th=[ 2073],
     | 99.00th=[ 2933], 99.50th=[ 3130], 99.90th=[ 3523], 99.95th=[ 3654],
     | 99.99th=[ 3884]
   bw (  KiB/s): min=317470, max=406584, per=100.00%, avg=358877.09, stdev=4126.92, samples=1436
   iops        : min=79367, max=101646, avg=89718.55, stdev=1031.72, samples=1436
  write: IOPS=22.4k, BW=87.5MiB/s (91.8MB/s)(15.4GiB/180004msec); 0 zone resets
    slat (nsec): min=1774, max=627701, avg=5996.73, stdev=6909.09
    clat (usec): min=21, max=14877, avg=316.76, stdev=172.71
     lat (usec): min=37, max=14883, avg=322.75, stdev=173.50
    clat percentiles (usec):
     |  1.00th=[   72],  5.00th=[   96], 10.00th=[  117], 20.00th=[  153],
     | 30.00th=[  190], 40.00th=[  235], 50.00th=[  306], 60.00th=[  371],
     | 70.00th=[  416], 80.00th=[  465], 90.00th=[  537], 95.00th=[  594],
     | 99.00th=[  709], 99.50th=[  766], 99.90th=[  898], 99.95th=[  971],
     | 99.99th=[ 1582]
   bw (  KiB/s): min=78685, max=101852, per=100.00%, avg=89719.31, stdev=1079.98, samples=1436
   iops        : min=19672, max=25462, avg=22429.10, stdev=269.99, samples=1436
  lat (usec)   : 20=0.01%, 50=0.01%, 100=1.18%, 250=22.47%, 500=45.42%
  lat (usec)   : 750=14.39%, 1000=3.68%
  lat (msec)   : 2=8.38%, 4=4.47%, 10=0.01%, 20=0.01%
  cpu          : usr=7.83%, sys=20.06%, ctx=4756427, majf=0, minf=4
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16133225,4033394,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
database-workload-disk1: (groupid=2, jobs=4): err= 0: pid=306255: Mon Mar 10 17:57:12 2025
  Description  : [Simulates database workload on disk1 (8K blocks, mostly random)]
  read: IOPS=135k, BW=1056MiB/s (1107MB/s)(247GiB/240001msec)
    slat (nsec): min=1020, max=842589, avg=3612.26, stdev=4514.11
    clat (usec): min=32, max=5088, avg=667.96, stdev=263.64
     lat (usec): min=35, max=5091, avg=671.57, stdev=263.96
    clat percentiles (usec):
     |  1.00th=[  157],  5.00th=[  237], 10.00th=[  306], 20.00th=[  424],
     | 30.00th=[  523], 40.00th=[  603], 50.00th=[  676], 60.00th=[  742],
     | 70.00th=[  816], 80.00th=[  889], 90.00th=[ 1004], 95.00th=[ 1106],
     | 99.00th=[ 1303], 99.50th=[ 1369], 99.90th=[ 1549], 99.95th=[ 1614],
     | 99.99th=[ 1795]
   bw (  MiB/s): min=  757, max= 1524, per=100.00%, avg=1056.96, stdev=45.85, samples=1916
   iops        : min=96930, max=195146, avg=135289.63, stdev=5869.18, samples=1916
  write: IOPS=45.1k, BW=352MiB/s (369MB/s)(82.5GiB/240001msec); 0 zone resets
    slat (nsec): min=1180, max=880403, avg=4112.55, stdev=4706.22
    clat (usec): min=21, max=13782, avg=818.56, stdev=683.91
     lat (usec): min=24, max=13788, avg=822.67, stdev=684.01
    clat percentiles (usec):
     |  1.00th=[   79],  5.00th=[  151], 10.00th=[  237], 20.00th=[  396],
     | 30.00th=[  515], 40.00th=[  619], 50.00th=[  717], 60.00th=[  807],
     | 70.00th=[  889], 80.00th=[  996], 90.00th=[ 1221], 95.00th=[ 2147],
     | 99.00th=[ 3916], 99.50th=[ 4424], 99.90th=[ 5473], 99.95th=[ 5997],
     | 99.99th=[ 7439]
   bw (  KiB/s): min=259315, max=528320, per=100.00%, avg=360966.20, stdev=15686.45, samples=1916
   iops        : min=32414, max=66040, avg=45120.08, stdev=1960.84, samples=1916
  lat (usec)   : 50=0.04%, 100=0.49%, 250=6.66%, 500=20.65%, 750=31.25%
  lat (usec)   : 1000=28.43%
  lat (msec)   : 2=11.09%, 4=1.15%, 10=0.23%, 20=0.01%
  cpu          : usr=8.12%, sys=20.67%, ctx=4913090, majf=0, minf=4
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=32438358,10818617,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
database-workload-disk2: (groupid=3, jobs=4): err= 0: pid=310005: Mon Mar 10 17:57:12 2025
  Description  : [Simulates database workload on disk2 (8K blocks, mostly random)]
  read: IOPS=63.7k, BW=497MiB/s (521MB/s)(117GiB/240002msec)
    slat (nsec): min=1455, max=1123.0k, avg=6086.85, stdev=7758.24
    clat (usec): min=57, max=16300, avg=1851.45, stdev=1056.22
     lat (usec): min=60, max=16309, avg=1857.54, stdev=1056.45
    clat percentiles (usec):
     |  1.00th=[  237],  5.00th=[  400], 10.00th=[  515], 20.00th=[  832],
     | 30.00th=[ 1123], 40.00th=[ 1434], 50.00th=[ 1745], 60.00th=[ 2073],
     | 70.00th=[ 2442], 80.00th=[ 2835], 90.00th=[ 3294], 95.00th=[ 3621],
     | 99.00th=[ 4293], 99.50th=[ 4752], 99.90th=[ 6587], 99.95th=[ 7570],
     | 99.99th=[ 8979]
   bw (  KiB/s): min=471982, max=550433, per=100.00%, avg=509763.31, stdev=3580.36, samples=1916
   iops        : min=58996, max=68804, avg=63719.60, stdev=447.55, samples=1916
  write: IOPS=21.2k, BW=166MiB/s (174MB/s)(38.8GiB/240002msec); 0 zone resets
    slat (nsec): min=1775, max=627672, avg=7068.88, stdev=7961.73
    clat (usec): min=18, max=22103, avg=447.48, stdev=1023.64
     lat (usec): min=43, max=22106, avg=454.55, stdev=1023.87
    clat percentiles (usec):
     |  1.00th=[   79],  5.00th=[  109], 10.00th=[  133], 20.00th=[  176],
     | 30.00th=[  217], 40.00th=[  277], 50.00th=[  347], 60.00th=[  392],
     | 70.00th=[  424], 80.00th=[  469], 90.00th=[  545], 95.00th=[  660],
     | 99.00th=[ 4359], 99.50th=[ 9503], 99.90th=[14222], 99.95th=[15270],
     | 99.99th=[17433]
   bw (  KiB/s): min=154421, max=186816, per=100.00%, avg=169896.91, stdev=1421.69, samples=1916
   iops        : min=19301, max=23352, avg=21236.22, stdev=177.70, samples=1916
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.92%, 250=8.99%, 500=18.43%
  lat (usec)   : 750=8.73%, 1000=6.91%
  lat (msec)   : 2=24.04%, 4=30.33%, 10=1.54%, 20=0.11%, 50=0.01%
  cpu          : usr=6.44%, sys=18.45%, ctx=6162588, majf=0, minf=4
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=15277287,5091577,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
file-server-disk1: (groupid=4, jobs=2): err= 0: pid=313855: Mon Mar 10 17:57:12 2025
  Description  : [Simulates file server workload on disk1 (mixed block sizes)]
  read: IOPS=76.2k, BW=298MiB/s (312MB/s)(69.8GiB/240001msec)
    slat (nsec): min=1637, max=895254, avg=4129.77, stdev=5526.86
    clat (usec): min=59, max=1934, avg=337.23, stdev=141.31
     lat (usec): min=68, max=1979, avg=341.36, stdev=141.82
    clat percentiles (usec):
     |  1.00th=[  128],  5.00th=[  157], 10.00th=[  178], 20.00th=[  206],
     | 30.00th=[  235], 40.00th=[  269], 50.00th=[  314], 60.00th=[  359],
     | 70.00th=[  404], 80.00th=[  465], 90.00th=[  537], 95.00th=[  586],
     | 99.00th=[  734], 99.50th=[  766], 99.90th=[  848], 99.95th=[  881],
     | 99.99th=[ 1057]
   bw (  KiB/s): min=224800, max=415144, per=100.00%, avg=305076.96, stdev=14925.70, samples=958
   iops        : min=56200, max=103786, avg=76268.85, stdev=3731.42, samples=958
  write: IOPS=19.1k, BW=74.5MiB/s (78.1MB/s)(17.5GiB/240001msec); 0 zone resets
    slat (nsec): min=1782, max=702110, avg=4859.85, stdev=5755.66
    clat (usec): min=27, max=9842, avg=304.33, stdev=178.59
     lat (usec): min=32, max=9850, avg=309.19, stdev=179.37
    clat percentiles (usec):
     |  1.00th=[   74],  5.00th=[   95], 10.00th=[  110], 20.00th=[  135],
     | 30.00th=[  161], 40.00th=[  196], 50.00th=[  260], 60.00th=[  347],
     | 70.00th=[  404], 80.00th=[  486], 90.00th=[  562], 95.00th=[  611],
     | 99.00th=[  758], 99.50th=[  791], 99.90th=[  848], 99.95th=[  873],
     | 99.99th=[  938]
   bw (  KiB/s): min=56144, max=105984, per=100.00%, avg=76348.20, stdev=3767.14, samples=958
   iops        : min=14035, max=26496, avg=19086.67, stdev=941.78, samples=958
  lat (usec)   : 50=0.01%, 100=1.41%, 250=36.20%, 500=46.74%, 750=14.85%
  lat (usec)   : 1000=0.79%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=10.00%, sys=24.81%, ctx=2569094, majf=0, minf=2
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=18288879,4577126,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file-server-disk2: (groupid=5, jobs=2): err= 0: pid=317456: Mon Mar 10 17:57:12 2025
  Description  : [Simulates file server workload on disk2 (mixed block sizes)]
  read: IOPS=64.4k, BW=251MiB/s (264MB/s)(58.9GiB/240002msec)
    slat (nsec): min=1614, max=1360.4k, avg=4555.16, stdev=5825.94
    clat (usec): min=41, max=4119, avg=425.89, stdev=394.91
     lat (usec): min=49, max=4126, avg=430.45, stdev=395.13
    clat percentiles (usec):
     |  1.00th=[  127],  5.00th=[  151], 10.00th=[  167], 20.00th=[  194],
     | 30.00th=[  223], 40.00th=[  262], 50.00th=[  314], 60.00th=[  367],
     | 70.00th=[  416], 80.00th=[  498], 90.00th=[  775], 95.00th=[ 1287],
     | 99.00th=[ 2212], 99.50th=[ 2507], 99.90th=[ 2999], 99.95th=[ 3130],
     | 99.99th=[ 3425]
   bw (  KiB/s): min=212616, max=295838, per=100.00%, avg=257776.40, stdev=6483.94, samples=958
   iops        : min=53153, max=73959, avg=64443.75, stdev=1621.01, samples=958
  write: IOPS=16.1k, BW=62.8MiB/s (65.9MB/s)(14.7GiB/240002msec); 0 zone resets
    slat (nsec): min=1779, max=343086, avg=5314.07, stdev=5989.09
    clat (usec): min=21, max=11944, avg=256.44, stdev=154.29
     lat (usec): min=38, max=11951, avg=261.76, stdev=155.07
    clat percentiles (usec):
     |  1.00th=[   72],  5.00th=[   90], 10.00th=[  102], 20.00th=[  122],
     | 30.00th=[  141], 40.00th=[  163], 50.00th=[  194], 60.00th=[  262],
     | 70.00th=[  347], 80.00th=[  404], 90.00th=[  486], 95.00th=[  545],
     | 99.00th=[  635], 99.50th=[  685], 99.90th=[  799], 99.95th=[  848],
     | 99.99th=[  979]
   bw (  KiB/s): min=53170, max=74916, per=100.00%, avg=64392.25, stdev=1687.25, samples=958
   iops        : min=13292, max=18729, avg=16097.71, stdev=421.82, samples=958
  lat (usec)   : 50=0.01%, 100=1.79%, 250=40.01%, 500=40.67%, 750=9.21%
  lat (usec)   : 1000=2.39%
  lat (msec)   : 2=4.69%, 4=1.22%, 10=0.01%, 20=0.01%
  cpu          : usr=8.76%, sys=25.40%, ctx=3750193, majf=0, minf=2
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=15449227,3859218,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
streaming-reads-disk1: (groupid=6, jobs=1): err= 0: pid=321137: Mon Mar 10 17:57:12 2025
  Description  : [Simulates large sequential reads on disk1 (video/backup)]
  read: IOPS=910, BW=910MiB/s (955MB/s)(160GiB/180009msec)
    slat (usec): min=23, max=1008, avg=53.85, stdev=11.10
    clat (usec): min=2215, max=12851, avg=8727.47, stdev=804.14
     lat (usec): min=2576, max=12909, avg=8781.32, stdev=803.74
    clat percentiles (usec):
     |  1.00th=[ 6915],  5.00th=[ 7439], 10.00th=[ 7701], 20.00th=[ 8029],
     | 30.00th=[ 8291], 40.00th=[ 8455], 50.00th=[ 8717], 60.00th=[ 8979],
     | 70.00th=[ 9110], 80.00th=[ 9372], 90.00th=[ 9765], 95.00th=[10028],
     | 99.00th=[10683], 99.50th=[10945], 99.90th=[11338], 99.95th=[11600],
     | 99.99th=[12125]
   bw (  KiB/s): min=917504, max=948224, per=100.00%, avg=933245.11, stdev=5240.31, samples=359
   iops        : min=  896, max=  926, avg=910.97, stdev= 5.15, samples=359
  lat (msec)   : 4=0.01%, 10=93.96%, 20=6.04%
  cpu          : usr=1.02%, sys=7.84%, ctx=152204, majf=0, minf=2049
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=163898,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
streaming-reads-disk2: (groupid=7, jobs=1): err= 0: pid=323834: Mon Mar 10 17:57:12 2025
  Description  : [Simulates large sequential reads on disk2 (video/backup)]
  read: IOPS=819, BW=819MiB/s (859MB/s)(144GiB/180010msec)
    slat (usec): min=26, max=650, avg=56.86, stdev=11.37
    clat (usec): min=1975, max=18125, avg=9705.74, stdev=314.09
     lat (usec): min=2336, max=18182, avg=9762.60, stdev=311.99
    clat percentiles (usec):
     |  1.00th=[ 9110],  5.00th=[ 9241], 10.00th=[ 9372], 20.00th=[ 9503],
     | 30.00th=[ 9503], 40.00th=[ 9634], 50.00th=[ 9634], 60.00th=[ 9765],
     | 70.00th=[ 9896], 80.00th=[ 9896], 90.00th=[10159], 95.00th=[10290],
     | 99.00th=[10552], 99.50th=[10552], 99.90th=[10814], 99.95th=[10814],
     | 99.99th=[12911]
   bw (  KiB/s): min=826997, max=845824, per=100.00%, avg=839529.04, stdev=2765.81, samples=359
   iops        : min=  807, max=  826, avg=819.54, stdev= 2.73, samples=359
  lat (msec)   : 2=0.01%, 4=0.01%, 10=83.48%, 20=16.52%
  cpu          : usr=1.03%, sys=7.28%, ctx=147364, majf=0, minf=1939
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=147436,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
streaming-writes-disk1: (groupid=8, jobs=1): err= 0: pid=326536: Mon Mar 10 17:57:12 2025
  Description  : [Simulates large sequential writes on disk1 (backup/logging)]
  write: IOPS=1984, BW=1984MiB/s (2081MB/s)(349GiB/180004msec); 0 zone resets
    slat (usec): min=40, max=468, avg=83.90, stdev=20.23
    clat (usec): min=1065, max=8535, avg=3943.35, stdev=460.73
     lat (usec): min=1142, max=8636, avg=4027.25, stdev=458.08
    clat percentiles (usec):
     |  1.00th=[ 2802],  5.00th=[ 3294], 10.00th=[ 3458], 20.00th=[ 3621],
     | 30.00th=[ 3720], 40.00th=[ 3818], 50.00th=[ 3884], 60.00th=[ 3982],
     | 70.00th=[ 4113], 80.00th=[ 4293], 90.00th=[ 4490], 95.00th=[ 4686],
     | 99.00th=[ 5342], 99.50th=[ 5669], 99.90th=[ 6259], 99.95th=[ 6390],
     | 99.99th=[ 6915]
   bw (  MiB/s): min= 1740, max= 2124, per=100.00%, avg=1986.36, stdev=78.64, samples=359
   iops        : min= 1740, max= 2124, avg=1986.16, stdev=78.77, samples=359
  lat (msec)   : 2=0.01%, 4=60.37%, 10=39.61%
  cpu          : usr=10.18%, sys=8.88%, ctx=317966, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,357213,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
streaming-writes-disk2: (groupid=9, jobs=1): err= 0: pid=329241: Mon Mar 10 17:57:12 2025
  Description  : [Simulates large sequential writes on disk2 (backup/logging)]
  write: IOPS=526, BW=527MiB/s (552MB/s)(92.6GiB/180012msec); 0 zone resets
    slat (usec): min=39, max=498, avg=82.48, stdev=21.68
    clat (usec): min=7830, max=26680, avg=15104.72, stdev=1510.82
     lat (usec): min=7926, max=26747, avg=15187.20, stdev=1508.54
    clat percentiles (usec):
     |  1.00th=[11207],  5.00th=[13566], 10.00th=[13698], 20.00th=[13829],
     | 30.00th=[13960], 40.00th=[14222], 50.00th=[14746], 60.00th=[15795],
     | 70.00th=[16188], 80.00th=[16319], 90.00th=[16450], 95.00th=[16909],
     | 99.00th=[20055], 99.50th=[21103], 99.90th=[23462], 99.95th=[23987],
     | 99.99th=[26346]
   bw (  KiB/s): min=523286, max=556120, per=100.00%, avg=539792.47, stdev=5152.12, samples=359
   iops        : min=  511, max=  543, avg=527.11, stdev= 5.03, samples=359
  lat (msec)   : 10=0.07%, 20=98.88%, 50=1.05%
  cpu          : usr=2.64%, sys=2.35%, ctx=55642, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,94798,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
mixed-workload-disk1: (groupid=10, jobs=4): err= 0: pid=331979: Mon Mar 10 17:57:12 2025
  Description  : [Random mix with various block sizes and depths on disk1]
  read: IOPS=24.4k, BW=1523MiB/s (1597MB/s)(446GiB/300007msec)
    slat (usec): min=2, max=657, avg=11.45, stdev=10.64
    clat (usec): min=85, max=7531, avg=616.01, stdev=211.82
     lat (usec): min=95, max=7539, avg=627.46, stdev=212.66
    clat percentiles (usec):
     |  1.00th=[  273],  5.00th=[  338], 10.00th=[  379], 20.00th=[  433],
     | 30.00th=[  482], 40.00th=[  529], 50.00th=[  578], 60.00th=[  635],
     | 70.00th=[  709], 80.00th=[  791], 90.00th=[  898], 95.00th=[ 1004],
     | 99.00th=[ 1237], 99.50th=[ 1336], 99.90th=[ 1549], 99.95th=[ 1647],
     | 99.99th=[ 1893]
   bw (  MiB/s): min= 1353, max= 1690, per=100.00%, avg=1524.39, stdev=14.44, samples=2396
   iops        : min=21656, max=27052, avg=24389.32, stdev=231.08, samples=2396
  write: IOPS=16.3k, BW=1016MiB/s (1066MB/s)(298GiB/300007msec); 0 zone resets
    slat (usec): min=3, max=648, avg=13.94, stdev=10.93
    clat (usec): min=29, max=29731, avg=6911.65, stdev=5626.54
     lat (usec): min=47, max=29739, avg=6925.59, stdev=5626.59
    clat percentiles (usec):
     |  1.00th=[   88],  5.00th=[  125], 10.00th=[  169], 20.00th=[  383],
     | 30.00th=[ 1254], 40.00th=[ 3851], 50.00th=[ 6718], 60.00th=[ 9634],
     | 70.00th=[11863], 80.00th=[13173], 90.00th=[14222], 95.00th=[14877],
     | 99.00th=[16188], 99.50th=[16712], 99.90th=[17695], 99.95th=[17957],
     | 99.99th=[19006]
   bw (  KiB/s): min=936704, max=1121233, per=100.00%, avg=1041890.07, stdev=8091.18, samples=2396
   iops        : min=14636, max=17518, avg=16278.74, stdev=126.48, samples=2396
  lat (usec)   : 50=0.01%, 100=0.82%, 250=4.97%, 500=24.68%, 750=26.00%
  lat (usec)   : 1000=12.02%
  lat (msec)   : 2=4.74%, 4=2.97%, 10=8.37%, 20=15.44%, 50=0.01%
  cpu          : usr=5.51%, sys=16.38%, ctx=5800343, majf=0, minf=4
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=7310087,4879123,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
mixed-workload-disk2: (groupid=11, jobs=4): err= 0: pid=336473: Mon Mar 10 17:57:12 2025
  Description  : [Random mix with various block sizes and depths on disk2]
  read: IOPS=6965, BW=435MiB/s (456MB/s)(128GiB/300015msec)
    slat (usec): min=3, max=626, avg=17.88, stdev=14.34
    clat (usec): min=230, max=35108, avg=6692.75, stdev=4607.37
     lat (usec): min=241, max=35113, avg=6710.62, stdev=4607.81
    clat percentiles (usec):
     |  1.00th=[  709],  5.00th=[ 1270], 10.00th=[ 1762], 20.00th=[ 2606],
     | 30.00th=[ 3458], 40.00th=[ 4490], 50.00th=[ 5407], 60.00th=[ 6587],
     | 70.00th=[ 8356], 80.00th=[10683], 90.00th=[14353], 95.00th=[16188],
     | 99.00th=[17957], 99.50th=[18744], 99.90th=[19792], 99.95th=[20055],
     | 99.99th=[20841]
   bw (  KiB/s): min=392719, max=503803, per=100.00%, avg=446278.44, stdev=4664.93, samples=2396
   iops        : min= 6136, max= 7871, avg=6972.16, stdev=72.83, samples=2396
  write: IOPS=4643, BW=290MiB/s (304MB/s)(85.0GiB/300015msec); 0 zone resets
    slat (usec): min=4, max=250, avg=20.58, stdev=14.41
    clat (usec): min=178, max=55002, avg=17468.69, stdev=7027.20
     lat (usec): min=189, max=55042, avg=17489.27, stdev=7027.20
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[ 3720], 10.00th=[ 5932], 20.00th=[11207],
     | 30.00th=[14746], 40.00th=[17171], 50.00th=[19268], 60.00th=[20579],
     | 70.00th=[21890], 80.00th=[23200], 90.00th=[24773], 95.00th=[26084],
     | 99.00th=[32637], 99.50th=[34341], 99.90th=[36963], 99.95th=[38011],
     | 99.99th=[40109]
   bw (  KiB/s): min=257151, max=329856, per=100.00%, avg=297521.42, stdev=2926.76, samples=2396
   iops        : min= 4016, max= 5154, avg=4648.14, stdev=45.70, samples=2396
  lat (usec)   : 250=0.01%, 500=0.28%, 750=0.82%, 1000=1.15%
  lat (msec)   : 2=6.48%, 4=14.79%, 10=29.35%, 20=29.19%, 50=17.93%
  lat (msec)   : 100=0.01%
  cpu          : usr=2.47%, sys=7.95%, ctx=1671480, majf=0, minf=4
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=2089694,1393259,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
latency-test-disk1: (groupid=12, jobs=1): err= 0: pid=341023: Mon Mar 10 17:57:12 2025
  Description  : [Tests I/O latency with small QD on disk1]
  read: IOPS=5380, BW=21.0MiB/s (22.0MB/s)(2522MiB/120001msec)
    slat (usec): min=4, max=226, avg= 5.92, stdev= 4.52
    clat (nsec): min=1166, max=1187.1k, avg=140343.60, stdev=45288.72
     lat (usec): min=91, max=1192, avg=146.26, stdev=48.39
    clat percentiles (usec):
     |  1.00th=[  110],  5.00th=[  113], 10.00th=[  114], 20.00th=[  117],
     | 30.00th=[  125], 40.00th=[  137], 50.00th=[  139], 60.00th=[  139],
     | 70.00th=[  141], 80.00th=[  143], 90.00th=[  149], 95.00th=[  165],
     | 99.00th=[  375], 99.50th=[  490], 99.90th=[  529], 99.95th=[  553],
     | 99.99th=[  644]
   bw (  KiB/s): min=17539, max=23544, per=100.00%, avg=21544.79, stdev=843.14, samples=239
   iops        : min= 4384, max= 5886, avg=5386.00, stdev=210.82, samples=239
  write: IOPS=2316, BW=9264KiB/s (9486kB/s)(1086MiB/120001msec); 0 zone resets
    slat (usec): min=4, max=225, avg= 6.21, stdev= 4.81
    clat (nsec): min=1208, max=1515.2k, avg=83164.23, stdev=42243.51
     lat (usec): min=46, max=1520, avg=89.37, stdev=45.93
    clat percentiles (usec):
     |  1.00th=[   59],  5.00th=[   61], 10.00th=[   62], 20.00th=[   63],
     | 30.00th=[   64], 40.00th=[   65], 50.00th=[   68], 60.00th=[   89],
     | 70.00th=[   94], 80.00th=[   96], 90.00th=[  100], 95.00th=[  112],
     | 99.00th=[  285], 99.50th=[  437], 99.90th=[  474], 99.95th=[  486],
     | 99.99th=[  523]
   bw (  KiB/s): min= 7599, max=10316, per=100.00%, avg=9274.60, stdev=445.35, samples=239
   iops        : min= 1899, max= 2579, avg=2318.39, stdev=111.27, samples=239
  lat (usec)   : 2=0.01%, 20=0.01%, 50=0.01%, 100=27.38%, 250=69.75%
  lat (usec)   : 500=2.62%, 750=0.24%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=2.42%, sys=8.20%, ctx=923613, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=645675,277924,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
latency-test-disk2: (groupid=13, jobs=1): err= 0: pid=342814: Mon Mar 10 17:57:12 2025
  Description  : [Tests I/O latency with small QD on disk2]
  read: IOPS=4143, BW=16.2MiB/s (17.0MB/s)(1942MiB/120001msec)
    slat (nsec): min=2566, max=89365, avg=6915.89, stdev=6380.70
    clat (usec): min=94, max=1383, avg=175.82, stdev=77.66
     lat (usec): min=99, max=1415, avg=182.73, stdev=82.05
    clat percentiles (usec):
     |  1.00th=[  143],  5.00th=[  145], 10.00th=[  145], 20.00th=[  147],
     | 30.00th=[  149], 40.00th=[  149], 50.00th=[  153], 60.00th=[  159],
     | 70.00th=[  161], 80.00th=[  165], 90.00th=[  237], 95.00th=[  326],
     | 99.00th=[  545], 99.50th=[  652], 99.90th=[  758], 99.95th=[  775],
     | 99.99th=[  816]
   bw (  KiB/s): min= 7624, max=19280, per=100.00%, avg=16586.97, stdev=2404.10, samples=239
   iops        : min= 1906, max= 4820, avg=4146.71, stdev=601.02, samples=239
  write: IOPS=1775, BW=7101KiB/s (7271kB/s)(832MiB/120001msec); 0 zone resets
    slat (usec): min=2, max=400, avg= 7.31, stdev= 6.86
    clat (usec): min=4, max=4396, avg=126.17, stdev=72.56
     lat (usec): min=61, max=4402, avg=133.48, stdev=77.66
    clat percentiles (usec):
     |  1.00th=[  100],  5.00th=[  102], 10.00th=[  102], 20.00th=[  104],
     | 30.00th=[  105], 40.00th=[  106], 50.00th=[  106], 60.00th=[  109],
     | 70.00th=[  112], 80.00th=[  113], 90.00th=[  135], 95.00th=[  262],
     | 99.00th=[  457], 99.50th=[  586], 99.90th=[  758], 99.95th=[  775],
     | 99.99th=[  816]
   bw (  KiB/s): min= 3384, max= 8488, per=100.00%, avg=7105.38, stdev=1045.46, samples=239
   iops        : min=  846, max= 2122, avg=1776.30, stdev=261.36, samples=239
  lat (usec)   : 10=0.01%, 100=0.38%, 250=91.61%, 500=6.74%, 750=1.14%
  lat (usec)   : 1000=0.13%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=1.84%, sys=7.58%, ctx=710290, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=497251,213018,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=446MiB/s (468MB/s), 446MiB/s-446MiB/s (468MB/s-468MB/s), io=78.4GiB (84.2GB), run=180001-180001msec
  WRITE: bw=111MiB/s (117MB/s), 111MiB/s-111MiB/s (117MB/s-117MB/s), io=19.6GiB (21.0GB), run=180001-180001msec

Run status group 1 (all jobs):
   READ: bw=350MiB/s (367MB/s), 350MiB/s-350MiB/s (367MB/s-367MB/s), io=61.5GiB (66.1GB), run=180004-180004msec
  WRITE: bw=87.5MiB/s (91.8MB/s), 87.5MiB/s-87.5MiB/s (91.8MB/s-91.8MB/s), io=15.4GiB (16.5GB), run=180004-180004msec

Run status group 2 (all jobs):
   READ: bw=1056MiB/s (1107MB/s), 1056MiB/s-1056MiB/s (1107MB/s-1107MB/s), io=247GiB (266GB), run=240001-240001msec
  WRITE: bw=352MiB/s (369MB/s), 352MiB/s-352MiB/s (369MB/s-369MB/s), io=82.5GiB (88.6GB), run=240001-240001msec

Run status group 3 (all jobs):
   READ: bw=497MiB/s (521MB/s), 497MiB/s-497MiB/s (521MB/s-521MB/s), io=117GiB (125GB), run=240002-240002msec
  WRITE: bw=166MiB/s (174MB/s), 166MiB/s-166MiB/s (174MB/s-174MB/s), io=38.8GiB (41.7GB), run=240002-240002msec

Run status group 4 (all jobs):
   READ: bw=298MiB/s (312MB/s), 298MiB/s-298MiB/s (312MB/s-312MB/s), io=69.8GiB (74.9GB), run=240001-240001msec
  WRITE: bw=74.5MiB/s (78.1MB/s), 74.5MiB/s-74.5MiB/s (78.1MB/s-78.1MB/s), io=17.5GiB (18.7GB), run=240001-240001msec

Run status group 5 (all jobs):
   READ: bw=251MiB/s (264MB/s), 251MiB/s-251MiB/s (264MB/s-264MB/s), io=58.9GiB (63.3GB), run=240002-240002msec
  WRITE: bw=62.8MiB/s (65.9MB/s), 62.8MiB/s-62.8MiB/s (65.9MB/s-65.9MB/s), io=14.7GiB (15.8GB), run=240002-240002msec

Run status group 6 (all jobs):
   READ: bw=910MiB/s (955MB/s), 910MiB/s-910MiB/s (955MB/s-955MB/s), io=160GiB (172GB), run=180009-180009msec

Run status group 7 (all jobs):
   READ: bw=819MiB/s (859MB/s), 819MiB/s-819MiB/s (859MB/s-859MB/s), io=144GiB (155GB), run=180010-180010msec

Run status group 8 (all jobs):
  WRITE: bw=1984MiB/s (2081MB/s), 1984MiB/s-1984MiB/s (2081MB/s-2081MB/s), io=349GiB (375GB), run=180004-180004msec

Run status group 9 (all jobs):
  WRITE: bw=527MiB/s (552MB/s), 527MiB/s-527MiB/s (552MB/s-552MB/s), io=92.6GiB (99.4GB), run=180012-180012msec

Run status group 10 (all jobs):
   READ: bw=1523MiB/s (1597MB/s), 1523MiB/s-1523MiB/s (1597MB/s-1597MB/s), io=446GiB (479GB), run=300007-300007msec
  WRITE: bw=1016MiB/s (1066MB/s), 1016MiB/s-1016MiB/s (1066MB/s-1066MB/s), io=298GiB (320GB), run=300007-300007msec

Run status group 11 (all jobs):
   READ: bw=435MiB/s (456MB/s), 435MiB/s-435MiB/s (456MB/s-456MB/s), io=128GiB (137GB), run=300015-300015msec
  WRITE: bw=290MiB/s (304MB/s), 290MiB/s-290MiB/s (304MB/s-304MB/s), io=85.0GiB (91.3GB), run=300015-300015msec

Run status group 12 (all jobs):
   READ: bw=21.0MiB/s (22.0MB/s), 21.0MiB/s-21.0MiB/s (22.0MB/s-22.0MB/s), io=2522MiB (2645MB), run=120001-120001msec
  WRITE: bw=9264KiB/s (9486kB/s), 9264KiB/s-9264KiB/s (9486kB/s-9486kB/s), io=1086MiB (1138MB), run=120001-120001msec

Run status group 13 (all jobs):
   READ: bw=16.2MiB/s (17.0MB/s), 16.2MiB/s-16.2MiB/s (17.0MB/s-17.0MB/s), io=1942MiB (2037MB), run=120001-120001msec
  WRITE: bw=7101KiB/s (7271kB/s), 7101KiB/s-7101KiB/s (7271kB/s-7271kB/s), io=832MiB (873MB), run=120001-120001msec

Disk stats (read/write):
  vdb: ios=79401654/26092522, merge=0/0, ticks=35104612/44393934, in_queue=79498544, util=38.98%
  vdc: ios=49611903/14697067, merge=0/0, ticks=57493181/29241972, in_queue=86735153, util=43.16%